{
  "id": "linear-equations-basics",
  "category": "math",
  "skill": "Algebra",
  "difficulty": "easy",
  "title": {
    "en": "Linear Equations: Solving for x in One Variable",
    "es": "Ecuaciones Lineales: Resolviendo para x en Una Variable",
    "fr": "Équations linéaires : Résoudre pour x avec une variable",
    "pt": "Equações Lineares: Resolvendo para x em Uma Variável",
    "ht": "Ekwasyon Lineyè: Rezoud pou x nan Yon Varyab"
  },
  "summary": {
    "en": "Master the fundamental techniques for solving linear equations with one variable. Learn to isolate variables and check your solutions.",
    "es": "Domina las técnicas fundamentales para resolver ecuaciones lineales con una variable. Aprende a aislar variables y verificar tus soluciones.",
    "fr": "Maîtrisez les techniques fondamentales pour résoudre les équations linéaires à une variable. Apprenez à isoler les variables et à vérifier vos solutions.",
    "pt": "Domine as técnicas fundamentais para resolver equações lineares com uma variável. Aprenda a isolar variáveis e verificar suas soluções.",
    "ht": "Metrize teknik fondamantal yo pou rezoud ekwasyon lineyè ak yon varyab. Aprann izole varyab yo epi verifye solisyon ou yo."
  },
  "fullContent": {
    "en": {
      "introduction": "Linear equations in one variable are the foundation of algebra. These equations follow the form ax + b = c, where you solve for the unknown variable x. Mastering this skill is essential for the SAT Math section.",
      "sections": [
        {
          "heading": "The Golden Rule: Balance",
          "content": "Whatever you do to one side of an equation, you must do to the other side. This keeps the equation balanced and valid."
        },
        {
          "heading": "Step-by-Step Process",
          "points": [
            "Simplify both sides: Combine like terms and distribute if needed",
            "Isolate the variable term: Use addition or subtraction to move constants to one side",
            "Solve for x: Use multiplication or division to get x alone",
            "Check your answer: Substitute your solution back into the original equation"
          ]
        },
        {
          "heading": "Common Mistakes to Avoid",
          "points": [
            "Forgetting to distribute the negative sign when subtracting",
            "Dividing by the wrong number",
            "Not simplifying before solving",
            "Forgetting to perform the same operation on both sides"
          ]
        },
        {
          "heading": "Special Cases",
          "content": "Watch out for equations with fractions, decimals, or variables on both sides. These require extra steps but follow the same principles."
        }
      ],
      "examples": [
        {
          "text": "Solve: 3x + 7 = 22",
          "explanation": "Subtract 7 from both sides: 3x = 15. Then divide by 3: x = 5. Check: 3(5) + 7 = 22 ✓"
        },
        {
          "text": "Solve: 2(x - 4) = 10",
          "explanation": "Distribute: 2x - 8 = 10. Add 8: 2x = 18. Divide by 2: x = 9. Check: 2(9 - 4) = 10 ✓"
        }
      ],
      "practiceHint": "When solving equations, always write down each step. This helps you catch mistakes and shows your work on the SAT. If an equation looks complicated, simplify first before attempting to isolate the variable."
    },
    "es": {
      "introduction": "Las ecuaciones lineales en una variable son la base del álgebra. Estas ecuaciones siguen la forma ax + b = c, donde resuelves para la variable desconocida x. Dominar esta habilidad es esencial para la sección de Matemáticas del SAT.",
      "sections": [
        {
          "heading": "La Regla de Oro: Equilibrio",
          "content": "Lo que hagas a un lado de la ecuación, debes hacerlo al otro lado. Esto mantiene la ecuación equilibrada y válida."
        },
        {
          "heading": "Proceso Paso a Paso",
          "points": [
            "Simplifica ambos lados: Combina términos semejantes y distribuye si es necesario",
            "Aísla el término variable: Usa suma o resta para mover constantes a un lado",
            "Resuelve para x: Usa multiplicación o división para obtener x solo",
            "Verifica tu respuesta: Sustituye tu solución en la ecuación original"
          ]
        },
        {
          "heading": "Errores Comunes a Evitar",
          "points": [
            "Olvidar distribuir el signo negativo al restar",
            "Dividir por el número incorrecto",
            "No simplificar antes de resolver",
            "Olvidar realizar la misma operación en ambos lados"
          ]
        },
        {
          "heading": "Casos Especiales",
          "content": "Ten cuidado con ecuaciones que tienen fracciones, decimales o variables en ambos lados. Estos requieren pasos adicionales pero siguen los mismos principios."
        }
      ],
      "examples": [
        {
          "text": "Resuelve: 3x + 7 = 22",
          "explanation": "Resta 7 de ambos lados: 3x = 15. Luego divide por 3: x = 5. Verifica: 3(5) + 7 = 22 ✓"
        },
        {
          "text": "Resuelve: 2(x - 4) = 10",
          "explanation": "Distribuye: 2x - 8 = 10. Suma 8: 2x = 18. Divide por 2: x = 9. Verifica: 2(9 - 4) = 10 ✓"
        }
      ],
      "practiceHint": "Al resolver ecuaciones, siempre escribe cada paso. Esto te ayuda a detectar errores y muestra tu trabajo en el SAT. Si una ecuación parece complicada, simplifica primero antes de intentar aislar la variable."
    },
    "fr": {
      "introduction": "Les équations linéaires à une variable sont le fondement de l'algèbre. Ces équations suivent la forme ax + b = c, où vous résolvez pour la variable inconnue x. Maîtriser cette compétence est essentiel pour la section Mathématiques du SAT.",
      "sections": [
        {
          "heading": "La règle d'or : Équilibre",
          "content": "Ce que vous faites d'un côté de l'équation, vous devez le faire de l'autre côté. Cela maintient l'équation équilibrée et valide."
        },
        {
          "heading": "Processus étape par étape",
          "points": [
            "Simplifiez les deux côtés : Combinez les termes similaires et distribuez si nécessaire",
            "Isolez le terme variable : Utilisez l'addition ou la soustraction pour déplacer les constantes d'un côté",
            "Résolvez pour x : Utilisez la multiplication ou la division pour obtenir x seul",
            "Vérifiez votre réponse : Substituez votre solution dans l'équation originale"
          ]
        },
        {
          "heading": "Erreurs courantes à éviter",
          "points": [
            "Oublier de distribuer le signe négatif lors de la soustraction",
            "Diviser par le mauvais nombre",
            "Ne pas simplifier avant de résoudre",
            "Oublier d'effectuer la même opération des deux côtés"
          ]
        },
        {
          "heading": "Cas particuliers",
          "content": "Faites attention aux équations avec des fractions, des décimales ou des variables des deux côtés. Celles-ci nécessitent des étapes supplémentaires mais suivent les mêmes principes."
        }
      ],
      "examples": [
        {
          "text": "Résolvez : 3x + 7 = 22",
          "explanation": "Soustrayez 7 des deux côtés : 3x = 15. Puis divisez par 3 : x = 5. Vérification : 3(5) + 7 = 22 ✓"
        },
        {
          "text": "Résolvez : 2(x - 4) = 10",
          "explanation": "Distribuez : 2x - 8 = 10. Ajoutez 8 : 2x = 18. Divisez par 2 : x = 9. Vérification : 2(9 - 4) = 10 ✓"
        }
      ],
      "practiceHint": "Lors de la résolution d'équations, écrivez toujours chaque étape. Cela vous aide à repérer les erreurs et montre votre travail au SAT. Si une équation semble compliquée, simplifiez d'abord avant de tenter d'isoler la variable."
    },
    "pt": {
      "introduction": "Equações lineares em uma variável são a base da álgebra. Essas equações seguem a forma ax + b = c, onde você resolve para a variável desconhecida x. Dominar essa habilidade é essencial para a seção de Matemática do SAT.",
      "sections": [
        {
          "heading": "A Regra de Ouro: Equilíbrio",
          "content": "O que você faz de um lado da equação, deve fazer do outro lado. Isso mantém a equação equilibrada e válida."
        },
        {
          "heading": "Processo Passo a Passo",
          "points": [
            "Simplifique ambos os lados: Combine termos semelhantes e distribua se necessário",
            "Isole o termo variável: Use adição ou subtração para mover constantes para um lado",
            "Resolva para x: Use multiplicação ou divisão para obter x sozinho",
            "Verifique sua resposta: Substitua sua solução na equação original"
          ]
        },
        {
          "heading": "Erros Comuns a Evitar",
          "points": [
            "Esquecer de distribuir o sinal negativo ao subtrair",
            "Dividir pelo número errado",
            "Não simplificar antes de resolver",
            "Esquecer de realizar a mesma operação em ambos os lados"
          ]
        },
        {
          "heading": "Casos Especiais",
          "content": "Cuidado com equações com frações, decimais ou variáveis dos dois lados. Essas requerem etapas extras mas seguem os mesmos princípios."
        }
      ],
      "examples": [
        {
          "text": "Resolva: 3x + 7 = 22",
          "explanation": "Subtraia 7 de ambos os lados: 3x = 15. Então divida por 3: x = 5. Verifique: 3(5) + 7 = 22 ✓"
        },
        {
          "text": "Resolva: 2(x - 4) = 10",
          "explanation": "Distribua: 2x - 8 = 10. Some 8: 2x = 18. Divida por 2: x = 9. Verifique: 2(9 - 4) = 10 ✓"
        }
      ],
      "practiceHint": "Ao resolver equações, sempre escreva cada passo. Isso ajuda a detectar erros e mostra seu trabalho no SAT. Se uma equação parecer complicada, simplifique primeiro antes de tentar isolar a variável."
    },
    "ht": {
      "introduction": "Ekwasyon lineyè nan yon varyab se baz aljèb la. Ekwasyon sa yo swiv fòm ax + b = c, kote w rezoud pou varyab enkonni x la. Metrize konpetans sa a esansyèl pou seksyon Matematik SAT la.",
      "sections": [
        {
          "heading": "Règ Lò a: Ekilibr",
          "content": "Sa w fè nan yon bò ekwasyon an, ou dwe fè l nan lòt bò a. Sa kenbe ekwasyon an ekilibre epi valid."
        },
        {
          "heading": "Pwosesis Etap pa Etap",
          "points": [
            "Senplifye tou de bò yo: Konbine tèm ki sanble epi distribye si nesesè",
            "Izole tèm varyab la: Sèvi ak adisyon oswa soustraksyon pou deplase konstan yo nan yon bò",
            "Rezoud pou x: Sèvi ak miltiplikasyon oswa divizyon pou jwenn x poukont li",
            "Verifye repons ou: Ranplase solisyon ou nan ekwasyon orijinal la"
          ]
        },
        {
          "heading": "Erè Komen pou Evite",
          "points": [
            "Bliye distribye siy negatif la lè w ap soustrè",
            "Divize pa move nonm lan",
            "Pa senplifye anvan rezoud",
            "Bliye fè menm operasyon an nan tou de bò yo"
          ]
        },
        {
          "heading": "Ka Espesyal",
          "content": "Fè atansyon ak ekwasyon ki gen fraksyon, desimal oswa varyab nan tou de bò yo. Sa yo mande etap adisyonèl men yo swiv menm prensip yo."
        }
      ],
      "examples": [
        {
          "text": "Rezoud: 3x + 7 = 22",
          "explanation": "Retire 7 nan tou de bò: 3x = 15. Lè sa a divize pa 3: x = 5. Verifye: 3(5) + 7 = 22 ✓"
        },
        {
          "text": "Rezoud: 2(x - 4) = 10",
          "explanation": "Distribye: 2x - 8 = 10. Ajoute 8: 2x = 18. Divize pa 2: x = 9. Verifye: 2(9 - 4) = 10 ✓"
        }
      ],
      "practiceHint": "Lè w ap rezoud ekwasyon, toujou ekri chak etap. Sa ede w detekte erè epi montre travay ou nan SAT la. Si yon ekwasyon sanble konplike, senplifye li anvan eseye izole varyab la."
    }
  }
}